{
  "activities": [
    {
      "id": 1,
      "name": "SuperPark Malaysia",
      "category": "Adventure & Sports",
      "subcategory": "Indoor Activity Park",
      "description": "SuperPark Malaysia is an all-in-one indoor activity park with three themed areas: Adventure Area (obstacle walls, trampolines, zip wires, slides), Game Arena (baseball, street basketball, SuperBowling), and Freestyle Hall (skate and scoot world, trampolines, climbing wall). It offers over 20 fun, healthy, and energizing activities for all ages.",
      "location": "Unit 4-1, Level 4, Avenue K Shopping Mall, 156, Jalan Ampang, 50450, Kuala Lumpur",
      "cost_rm": 60,
      "cost_usd": 12.75,
      "duration_hours": 3,
      "best_time": "Anytime during operating hours (10 AM - 7 PM daily)",
      "tips": "Book tickets online in advance. Grip socks are mandatory and must be purchased separately. Arrive 15 minutes early for registration and safety briefing. Children under 12 must be accompanied by a paid parent.",
      "photos": [
        "/KL-trip/assets/images/activities/superpark-malaysia/1.jpg",
        "/KL-trip/assets/images/activities/superpark-malaysia/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 2,
      "name": "LYL Circuit",
      "category": "Adventure & Sports",
      "subcategory": "Go-Karting",
      "description": "LYL International Karting Circuit is Asia's largest karting circuit, featuring a 1.5km track with 23 corners. They offer single and dual karts for both beginners and experienced drivers, including the Sodikart 270cc, 390cc, and 2 Drive models. The track includes a flyover for an extra thrill.",
      "location": "Lot 683, Monkeys Canopy Resort, Jalan Persiaran Bukit Enggang, Sungai Long Hill, Sungai Long, 43200 Kajang, Selangor",
      "cost_rm": 70,
      "cost_usd": 14.87,
      "duration_hours": 0.17,
      "best_time": "Anytime during operating hours (12 PM - 12 AM daily)",
      "tips": "Book your session in advance. It is mandatory to use a balaclava, gloves, and closed-toe shoes. You can rent a balaclava and gloves if you don't have your own. Arrive early for registration and safety briefing.",
      "photos": [
        "/KL-trip/assets/images/activities/lyl-circuit/1.jpg",
        "/KL-trip/assets/images/activities/lyl-circuit/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 3,
      "name": "Skytrex Adventure Sungai Congkak",
      "category": "Adventure & Sports",
      "subcategory": "Ziplining & High Ropes",
      "description": "Skytrex Adventure offers a tree-to-tree 'sky-trekking' experience where you can fly, swing, glide, and dangle on various aerial obstacles suspended in the lush tropical rainforest of Sungai Congkak. They have different circuits with varying difficulty levels, including the River Thrill (Intermediate) and Rapid Extreme (Advanced).",
      "location": "Jalan Sungai Congkak, Kampung Padang, 43100 Hulu Langat, Selangor",
      "cost_rm": 55,
      "cost_usd": 11.68,
      "duration_hours": 2.5,
      "best_time": "Morning to avoid the afternoon heat and potential rain.",
      "tips": "Book tickets online in advance to secure your spot. Wear comfortable sportswear and closed-toe shoes. Bring insect repellent and a change of clothes. A minimum height of 110cm is required for the River Thrill circuit.",
      "photos": [
        "/KL-trip/assets/images/activities/skytrex-adventure/1.jpg",
        "/KL-trip/assets/images/activities/skytrex-adventure/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 4,
      "name": "ATV Adventure Park Kuala Lumpur",
      "category": "Adventure & Sports",
      "subcategory": "ATV Riding",
      "description": "Experience an exhilarating off-road adventure at ATV Adventure Park Kuala Lumpur. Choose from various packages that take you through jungle trails, to stunning waterfalls, and offer panoramic views of Kuala Lumpur and the Kelang Gate Dam. They offer different trails suitable for various skill levels and durations.",
      "location": "Kampung Kemensah, 68000 Ampang Jaya, Selangor",
      "cost_rm": 100,
      "cost_usd": 21.25,
      "duration_hours": 1.5,
      "best_time": "Morning or late afternoon to avoid the midday heat. Weekdays are less crowded.",
      "tips": "Wear comfortable clothing that you don't mind getting dirty, and closed-toe shoes. Bring a change of clothes and a towel. Book in advance, especially for weekends. They provide protective equipment.",
      "photos": [
        "/KL-trip/assets/images/activities/atv-adventure-park/1.jpg",
        "/KL-trip/assets/images/activities/atv-adventure-park/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 5,
      "name": "District 21",
      "category": "Adventure & Sports",
      "subcategory": "Indoor Adventure Park",
      "description": "District 21 is an apocalypse-themed indoor adventure park located in IOI City Mall, Putrajaya. It features 8 prominent attractions including a Tubby Ride, Launch Pad trampolines, and various climbing and sliding activities. It's designed for all ages and offers a unique, active experience.",
      "location": "IOI City Mall, Putrajaya, 62502 Putrajaya, Wilayah Persekutuan Putrajaya",
      "cost_rm": 64,
      "cost_usd": 13.60,
      "duration_hours": 3,
      "best_time": "Weekdays are less crowded. Open from 12 PM - 8 PM on weekdays and 10 AM - 8 PM on weekends/public holidays.",
      "tips": "Wear comfortable clothing and sports shoes are compulsory for active tickets. Book tickets online in advance to avoid queues. Lockers are available for personal belongings.",
      "photos": [
        "/KL-trip/assets/images/activities/district-21/1.jpg",
        "/KL-trip/assets/images/activities/district-21/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 6,
      "name": "Camp5 Climbing Gym Eco City",
      "category": "Adventure & Sports",
      "subcategory": "Indoor Rock Climbing",
      "description": "Camp5 Eco City is Southeast Asia's largest bouldering facility, offering almost 1000sqm of bouldering, 33 top-ropes, auto-belays, and 2 lead lanes. It caters to climbers of all levels with a dedicated kids' area, fitness studio, and various training walls. It's a great place to climb, connect, and share the passion for climbing.",
      "location": "4th Floor, KL Eco City Mall, No 3 Jalan Bangsar, Kuala Lumpur 59200, Malaysia",
      "cost_rm": 42,
      "cost_usd": 8.93,
      "duration_hours": 3,
      "best_time": "Weekdays before 4 PM for off-peak rates. Open Mon-Fri 10 AM - 10 PM, Weekends/Public Holidays 10 AM - 8 PM.",
      "tips": "First-timers can try the 'Try Climbing' package which includes gear rental and a guide. Wear comfortable athletic clothing. Climbing shoes and harnesses are available for rent. Book in advance for guided sessions.",
      "photos": [
        "/KL-trip/assets/images/activities/camp5-climbing-gym/1.jpg",
        "/KL-trip/assets/images/activities/camp5-climbing-gym/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 7,
      "name": "VAR LIVE Theme Park",
      "category": "Adventure & Sports",
      "subcategory": "Virtual Reality Experience",
      "description": "VAR LIVE is Malaysia's largest VR theme park, offering an immersive 4D virtual reality experience with 13 exciting in-house attractions. Games like Zombie Jail, Crazy Rush, and Super Ninja combine VR with physical decorations, imitation guns, vibrating floors, and wind effects for a truly engaging experience.",
      "location": "L2-015, MyTOWN Shopping Centre, No. 6, Jalan Cochrane, 55100 Kuala Lumpur",
      "cost_rm": 108,
      "cost_usd": 22.95,
      "duration_hours": 1.5,
      "best_time": "Anytime during operating hours (10 AM - 10 PM daily). Weekdays might be less crowded.",
      "tips": "Book your session in advance, especially for weekends. Wear comfortable clothing. They provide all necessary VR equipment. Consider a multi-game package for a more complete experience.",
      "photos": [
        "/KL-trip/assets/images/activities/var-live/1.jpg",
        "/KL-trip/assets/images/activities/var-live/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 8,
      "name": "Village Park Restaurant",
      "category": "Food & Dining",
      "subcategory": "Local Cuisine",
      "description": "Village Park Restaurant is legendary for serving one of the best nasi lemak in Kuala Lumpur. This traditional Malay breakfast spot features fluffy coconut rice, crispy fried chicken, sambal chili, hard-boiled egg, and anchovies. The restaurant has been serving locals and tourists for over 20 years and is consistently packed with customers eager to taste their famous dish.",
      "location": "5, Jalan SS 21/37, Damansara Utama, 47400 Petaling Jaya, Selangor",
      "cost_rm": 13,
      "cost_usd": 3,
      "duration_hours": 1,
      "best_time": "Weekday mornings to avoid long queues. Open 7 AM - 3 PM daily.",
      "tips": "Arrive early to avoid the crowds, especially on weekends when tour groups visit. The nasi lemak ayam goreng (fried chicken) is the signature dish. Be prepared to wait during peak hours. Cash payment preferred.",
      "photos": [
        "/KL-trip/assets/images/activities/village-park-restaurant/1.jpg"
      ],
      "added_date": "2025-10-10",
      "source": "proactive_research"
    },
    {
      "id": 9,
      "name": "Jalan Alor Food Street",
      "category": "Food & Dining",
      "subcategory": "Street Food",
      "description": "Jalan Alor is Kuala Lumpur's most famous street food destination, transforming into a bustling night market every evening. This vibrant open-air dining street features dozens of restaurants and stalls serving authentic Malaysian and Chinese cuisine including BBQ seafood, satay, grilled meats, noodles, and local delicacies. The atmosphere is lively with colorful lanterns, outdoor seating, and the aroma of sizzling food.",
      "location": "Jalan Alor, Bukit Bintang, 50200 Kuala Lumpur",
      "cost_rm": 30,
      "cost_usd": 7,
      "duration_hours": 2,
      "best_time": "Evening from 6 PM onwards when the street comes alive. Best visited between 7-9 PM.",
      "tips": "Try Wong Ah Wah for famous chicken wings. Prices can vary, so check before ordering. Bargaining is sometimes possible. Bring cash as many stalls don't accept cards. Great for group dining with variety of options.",
      "photos": [
        "/KL-trip/assets/images/activities/jalan-alor-food-street/1.jpg",
        "/KL-trip/assets/images/activities/jalan-alor-food-street/2.jpg"
      ],
      "added_date": "2025-10-10",
      "source": "proactive_research"
    },
    {
      "id": 10,
      "name": "Madam Kwan's",
      "category": "Food & Dining",
      "subcategory": "Malaysian Cuisine",
      "description": "Madam Kwan's is an iconic Malaysian restaurant chain known for serving authentic Truly Malaysian cuisine in a comfortable, modern setting. Their menu features classic dishes like nasi lemak, beef rendang, assam laksa, and their famous nasi bojari. The restaurant offers a refined dining experience while maintaining traditional flavors, making it perfect for groups wanting to experience Malaysian food in an air-conditioned environment.",
      "location": "Suria KLCC, Lot 228, Level 2, Kuala Lumpur City Centre, 50088 Kuala Lumpur",
      "cost_rm": 40,
      "cost_usd": 9,
      "duration_hours": 1.5,
      "best_time": "Lunch (11:30 AM - 2 PM) or early dinner (5:30 PM - 7 PM) to avoid peak crowds.",
      "tips": "Try the nasi bojari (their signature dish) or nasi lemak with beef rendang. Reservations recommended for large groups. Located conveniently in KLCC for easy access. Credit cards accepted.",
      "photos": [
        "/KL-trip/assets/images/activities/madam-kwans/1.jpg",
        "/KL-trip/assets/images/activities/madam-kwans/2.jpg"
      ],
      "added_date": "2025-10-10",
      "source": "proactive_research"
    },
    {
      "id": 11,
      "name": "Merchant's Lane",
      "category": "Food & Dining",
      "subcategory": "Cafe & Brunch",
      "description": "Merchant's Lane is a trendy, Instagram-worthy cafe hidden in a restored heritage shophouse along Petaling Street in Chinatown. This hipster cafe serves Western cuisine with local twists, excellent coffee, and creative brunch dishes. The interior features vintage decor, exposed brick walls, and a charming courtyard. It's a popular spot for coffee lovers and those seeking a unique dining atmosphere in the heart of old KL.",
      "location": "150, Jalan Petaling, City Centre, 50000 Kuala Lumpur",
      "cost_rm": 50,
      "cost_usd": 11,
      "duration_hours": 1.5,
      "best_time": "Weekday afternoons (2-5 PM) for a quieter experience. Open 11 AM - 11 PM daily.",
      "tips": "Try their signature coffee and brunch items. The cafe can get crowded on weekends. Great for photos with its unique heritage interior. Reservations not accepted, so arrive early. Located near Central Market and Petaling Street.",
      "photos": [
        "/KL-trip/assets/images/activities/merchants-lane/1.jpg",
        "/KL-trip/assets/images/activities/merchants-lane/2.jpg"
      ],
      "added_date": "2025-10-10",
      "source": "proactive_research"
    },
    {
      "id": 12,
      "name": "Old China Cafe",
      "category": "Food & Dining",
      "subcategory": "Heritage Cuisine",
      "description": "Old China Cafe is a charming heritage restaurant housed in a beautifully preserved 1920s building that was once a laundry and guild house. Specializing in authentic Nyonya (Peranakan) cuisine, the restaurant offers a unique blend of Chinese and Malay flavors. The atmospheric interior features antique furniture, vintage photos, and traditional decor that transport diners back in time. It's a cultural dining experience showcasing Straits Chinese heritage.",
      "location": "11, Jalan Balai Polis, 50000 Kuala Lumpur",
      "cost_rm": 35,
      "cost_usd": 8,
      "duration_hours": 1.5,
      "best_time": "Lunch hours (12-2 PM) or early dinner (6-7 PM). Closed Mondays.",
      "tips": "Try the ayam pongteh (chicken stew) and pai tee (crispy cups). The restaurant has a nostalgic ambiance perfect for experiencing KL's heritage. Located near Merdeka Square and Central Market. Reservations recommended for weekends.",
      "photos": [
        "/KL-trip/assets/images/activities/old-china-cafe/1.jpg",
        "/KL-trip/assets/images/activities/old-china-cafe/2.jpg"
      ],
      "added_date": "2025-10-10",
      "source": "proactive_research"
    },
    {
      "id": 13,
      "name": "Lot 10 Hutong",
      "category": "Food & Dining",
      "subcategory": "Food Court",
      "description": "Lot 10 Hutong is Malaysia's first and only heritage food court, bringing together iconic hawker stalls and legendary food vendors under one air-conditioned roof. This award-winning food village features over 20 stalls serving the best of Malaysian street food, from Kim Lian Kee's Hokkien mee to Soong Kee's beef noodles. It's an excellent way to sample multiple Malaysian dishes in a comfortable, modern setting without sacrificing authenticity.",
      "location": "Basement Floor, Lot 10 Shopping Centre, 50 Jalan Sultan Ismail, Bukit Bintang, 50250 Kuala Lumpur",
      "cost_rm": 25,
      "cost_usd": 6,
      "duration_hours": 1.5,
      "best_time": "Lunch (12-2 PM) or dinner (6-8 PM). Open 10 AM - 10 PM daily.",
      "tips": "Perfect for groups as everyone can choose different dishes. Try multiple stalls to sample variety. Located right next to Bukit Bintang Monorail station. Cash and cards accepted. Air-conditioned comfort with authentic hawker food.",
      "photos": [
        "/KL-trip/assets/images/activities/lot-10-hutong/1.jpg",
        "/KL-trip/assets/images/activities/lot-10-hutong/2.jpg"
      ],
      "added_date": "2025-10-10",
      "source": "proactive_research"
    },
    {
      "id": 14,
      "name": "Feeka Coffee Roasters",
      "category": "Food & Dining",
      "subcategory": "Cafe & Coffee",
      "description": "Feeka Coffee Roasters is a popular specialty coffee cafe known for its excellent coffee, cozy atmosphere, and delicious brunch menu. Located in the heart of Bukit Bintang, this cafe serves freshly roasted coffee, creative beverages, and Western-Asian fusion dishes. The interior features a warm, inviting design with plenty of natural light, making it a perfect spot for coffee enthusiasts and casual dining.",
      "location": "19, Jalan Mesui, Bukit Bintang, 50200 Kuala Lumpur",
      "cost_rm": 35,
      "cost_usd": 8,
      "duration_hours": 1.5,
      "best_time": "Weekday mornings (9-11 AM) or afternoons (3-5 PM). Open 9 AM - 10 PM daily.",
      "tips": "Try their signature coffee drinks and brunch items like eggs benedict. Popular spot so expect queues on weekends. Great for working or casual meetings with good WiFi. Short walk from Bukit Bintang area.",
      "photos": [
        "/KL-trip/assets/images/activities/feeka-coffee-roasters/1.jpg",
        "/KL-trip/assets/images/activities/feeka-coffee-roasters/2.jpg"
      ],
      "added_date": "2025-10-10",
      "source": "proactive_research"
    }
  ]
}

