{
  "activities": [
    {
      "id": 1,
      "name": "SuperPark Malaysia",
      "category": "Adventure & Sports",
      "subcategory": "Indoor Activity Park",
      "description": "SuperPark Malaysia is an all-in-one indoor activity park with three themed areas: Adventure Area (obstacle walls, trampolines, zip wires, slides), Game Arena (baseball, street basketball, SuperBowling), and Freestyle Hall (skate and scoot world, trampolines, climbing wall). It offers over 20 fun, healthy, and energizing activities for all ages.",
      "location": "Unit 4-1, Level 4, Avenue K Shopping Mall, 156, Jalan Ampang, 50450, Kuala Lumpur",
      "cost_rm": 60,
      "cost_usd": 12.75,
      "duration_hours": 3,
      "best_time": "Anytime during operating hours (10 AM - 7 PM daily)",
      "tips": "Book tickets online in advance. Grip socks are mandatory and must be purchased separately. Arrive 15 minutes early for registration and safety briefing. Children under 12 must be accompanied by a paid parent.",
      "photos": [
        "/KL-trip/assets/images/activities/superpark-malaysia/1.jpg",
        "/KL-trip/assets/images/activities/superpark-malaysia/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 2,
      "name": "LYL Circuit",
      "category": "Adventure & Sports",
      "subcategory": "Go-Karting",
      "description": "LYL International Karting Circuit is Asia's largest karting circuit, featuring a 1.5km track with 23 corners. They offer single and dual karts for both beginners and experienced drivers, including the Sodikart 270cc, 390cc, and 2 Drive models. The track includes a flyover for an extra thrill.",
      "location": "Lot 683, Monkeys Canopy Resort, Jalan Persiaran Bukit Enggang, Sungai Long Hill, Sungai Long, 43200 Kajang, Selangor",
      "cost_rm": 70,
      "cost_usd": 14.87,
      "duration_hours": 0.17,
      "best_time": "Anytime during operating hours (12 PM - 12 AM daily)",
      "tips": "Book your session in advance. It is mandatory to use a balaclava, gloves, and closed-toe shoes. You can rent a balaclava and gloves if you don't have your own. Arrive early for registration and safety briefing.",
      "photos": [
        "/KL-trip/assets/images/activities/lyl-circuit/1.jpg",
        "/KL-trip/assets/images/activities/lyl-circuit/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 3,
      "name": "Skytrex Adventure Sungai Congkak",
      "category": "Adventure & Sports",
      "subcategory": "Ziplining & High Ropes",
      "description": "Skytrex Adventure offers a tree-to-tree 'sky-trekking' experience where you can fly, swing, glide, and dangle on various aerial obstacles suspended in the lush tropical rainforest of Sungai Congkak. They have different circuits with varying difficulty levels, including the River Thrill (Intermediate) and Rapid Extreme (Advanced).",
      "location": "Jalan Sungai Congkak, Kampung Padang, 43100 Hulu Langat, Selangor",
      "cost_rm": 55,
      "cost_usd": 11.68,
      "duration_hours": 2.5,
      "best_time": "Morning to avoid the afternoon heat and potential rain.",
      "tips": "Book tickets online in advance to secure your spot. Wear comfortable sportswear and closed-toe shoes. Bring insect repellent and a change of clothes. A minimum height of 110cm is required for the River Thrill circuit.",
      "photos": [
        "/KL-trip/assets/images/activities/skytrex-adventure/1.jpg",
        "/KL-trip/assets/images/activities/skytrex-adventure/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 4,
      "name": "ATV Adventure Park Kuala Lumpur",
      "category": "Adventure & Sports",
      "subcategory": "ATV Riding",
      "description": "Experience an exhilarating off-road adventure at ATV Adventure Park Kuala Lumpur. Choose from various packages that take you through jungle trails, to stunning waterfalls, and offer panoramic views of Kuala Lumpur and the Kelang Gate Dam. They offer different trails suitable for various skill levels and durations.",
      "location": "Kampung Kemensah, 68000 Ampang Jaya, Selangor",
      "cost_rm": 100,
      "cost_usd": 21.25,
      "duration_hours": 1.5,
      "best_time": "Morning or late afternoon to avoid the midday heat. Weekdays are less crowded.",
      "tips": "Wear comfortable clothing that you don't mind getting dirty, and closed-toe shoes. Bring a change of clothes and a towel. Book in advance, especially for weekends. They provide protective equipment.",
      "photos": [
        "/KL-trip/assets/images/activities/atv-adventure-park/1.jpg",
        "/KL-trip/assets/images/activities/atv-adventure-park/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 5,
      "name": "District 21",
      "category": "Adventure & Sports",
      "subcategory": "Indoor Adventure Park",
      "description": "District 21 is an apocalypse-themed indoor adventure park located in IOI City Mall, Putrajaya. It features 8 prominent attractions including a Tubby Ride, Launch Pad trampolines, and various climbing and sliding activities. It's designed for all ages and offers a unique, active experience.",
      "location": "IOI City Mall, Putrajaya, 62502 Putrajaya, Wilayah Persekutuan Putrajaya",
      "cost_rm": 64,
      "cost_usd": 13.60,
      "duration_hours": 3,
      "best_time": "Weekdays are less crowded. Open from 12 PM - 8 PM on weekdays and 10 AM - 8 PM on weekends/public holidays.",
      "tips": "Wear comfortable clothing and sports shoes are compulsory for active tickets. Book tickets online in advance to avoid queues. Lockers are available for personal belongings.",
      "photos": [
        "/KL-trip/assets/images/activities/district-21/1.jpg",
        "/KL-trip/assets/images/activities/district-21/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 6,
      "name": "Camp5 Climbing Gym Eco City",
      "category": "Adventure & Sports",
      "subcategory": "Indoor Rock Climbing",
      "description": "Camp5 Eco City is Southeast Asia's largest bouldering facility, offering almost 1000sqm of bouldering, 33 top-ropes, auto-belays, and 2 lead lanes. It caters to climbers of all levels with a dedicated kids' area, fitness studio, and various training walls. It's a great place to climb, connect, and share the passion for climbing.",
      "location": "4th Floor, KL Eco City Mall, No 3 Jalan Bangsar, Kuala Lumpur 59200, Malaysia",
      "cost_rm": 42,
      "cost_usd": 8.93,
      "duration_hours": 3,
      "best_time": "Weekdays before 4 PM for off-peak rates. Open Mon-Fri 10 AM - 10 PM, Weekends/Public Holidays 10 AM - 8 PM.",
      "tips": "First-timers can try the 'Try Climbing' package which includes gear rental and a guide. Wear comfortable athletic clothing. Climbing shoes and harnesses are available for rent. Book in advance for guided sessions.",
      "photos": [
        "/KL-trip/assets/images/activities/camp5-climbing-gym/1.jpg",
        "/KL-trip/assets/images/activities/camp5-climbing-gym/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    },
    {
      "id": 7,
      "name": "VAR LIVE Theme Park",
      "category": "Adventure & Sports",
      "subcategory": "Virtual Reality Experience",
      "description": "VAR LIVE is Malaysia's largest VR theme park, offering an immersive 4D virtual reality experience with 13 exciting in-house attractions. Games like Zombie Jail, Crazy Rush, and Super Ninja combine VR with physical decorations, imitation guns, vibrating floors, and wind effects for a truly engaging experience.",
      "location": "L2-015, MyTOWN Shopping Centre, No. 6, Jalan Cochrane, 55100 Kuala Lumpur",
      "cost_rm": 108,
      "cost_usd": 22.95,
      "duration_hours": 1.5,
      "best_time": "Anytime during operating hours (10 AM - 10 PM daily). Weekdays might be less crowded.",
      "tips": "Book your session in advance, especially for weekends. Wear comfortable clothing. They provide all necessary VR equipment. Consider a multi-game package for a more complete experience.",
      "photos": [
        "/KL-trip/assets/images/activities/var-live/1.jpg",
        "/KL-trip/assets/images/activities/var-live/2.jpg"
      ],
      "added_date": "2025-10-08",
      "source": "proactive_research"
    }
  ]
}
